source/_posts/2013-09-22-gogaruco-2013.html
---
layout: post
title: "GoGaRuCo 2013: Community > Code"
date: 2013-09-22 16:23
comments: true
categories: 
keywords: 
description: A Newbie's 2013 GoGaRuCo Experience
canonical: https://www.shakacode.com/blog/gogaruco-2013/
---

<p>
This past weekend was my first <a href="http://gogaruco.com/">GoGaRuCo</a>. Here's a perspective from a newbie,
along with lots of photos.
</p>
<a target=_ href=https://www.facebook.com/photo.php?fbid=674318365913265&set=a.674315479246887.1073741830.484394724905631&type=1>
<p>
{% img /images/2013-09-22-gogaruco-2013/GoGaRuCo1.jpg %}
</p>
</a>

<p>
The number one thing I discovered is that GoGaRuCo, like Ruby, is not just about
code. It's about the awesome people and the community. 
</p>

<p>
If you just want to see the talks at GoGaRuCo, don't attend. All of the talks
will be available on web shortly. So why did the conference sell out, with about
200 wait-listed people begging to attend?
</p>

<p>
GoGaRuCo attendees are madly passionate about programming, especially in Ruby.
Most attendees work at start-ups, at web consulting firms, or as freelancers.
The common thread is that we all love to program. It's not work. It's a passion.
And it's artistic, cutting-edge, relevant, and fun!
</p>

<p>
Amongst the community, there's a genuine feeling that we're all in this
together, and the more we can help each other, the better off we and the world
will be. This is truly the open source spirit of contributing whatever code you
can give back to the community. Consequently, for me, attending the conference
was about meeting others who contribute to open-source and learning more about
how I can contribute. As a bonus, I got a chance to personally meet the people
whom I follow on Twitter, read their blogs, and use their open source.
</p>

<!-- more -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">My Top 14 for 2013 GoGaRuCo</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Won't need to buy any new T-shirts for a long time.
</li>
<li>Got a poster tube that doubles as a form for caissons.
</li>
<li>No stress over picking which talks to attend, with one track.
</li>
<li>Can, but won't, write my own replacement for <a href="http://www.confreaks.com/videos/2669-gogaruco2013-the-littlest-orm">ActiveRecord</a> and IRB.
</li>
<li><a href="http://www.confreaks.com/videos/2670-gogaruco2013-solving-the-rubik-s-cube-in-20-seconds">Will finally be able to solve the Rubik's cube (soon).</a>
</li>
<li>Now understand why privacy from the NSA really does matter to me.
</li>
<li>Can write Ruby to fly a surveillance drone.
</li>
<li>Got tips on the performance tuning one of the biggest open source rails
applications, Discourse.
</li>
<li>Everything I wanted to know about Ruby, and my co-worker's compensation, but
was afraid to ask.
</li>
<li><a href="https://www.youtube.com/watch?v=6cdbx1BmboQ">Who is @JEG2?</a>
</li>
<li>Plenty of break time between talks made for lots of conversation.
</li>
<li>Personally met many of the folks I follow on Twitter!
</li>
<li>Most folks I met want to visit me in Maui at my B&amp;B <a href="http://www.sugarranchmaui.com">Sugar Ranch Maui</a>!
</li>
<li>Met the most talented and interesting group of programmers anywhere, who
all love Ruby and programming just as much as I do.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Tips</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Don't miss the pre-parties, breakfasts, or after-parties.
</li>
<li>Don't plan to work during the conference, and leave your laptop at home. An
good mobile phone or tablet is very useful.
</li>
<li>Sign up early if hanging out with other passionate programmers is your idea
of fun!
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Ruby on Maui, 2014?</h2>
<div class="outline-text-2" id="text-3">
<p>
If you interested in attending a small Ruby conference in Maui next year, maybe
in May, please get in touch with me.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Photographs</h2>
<div class="outline-text-2" id="text-4">
<p>
If you'd like full resolution, non-watermarked copies of any of the images,
please get in touch with me. I personally cropped and adjusted the exposure on
all images. These were taken with a Nikon D5100, SB-400 AF Flash, and a very
basic Nikon 18-55mm lens.
</p>

<p>
I hope that folks tag themselves in the Facebook albums! And please share them.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Facebook</h3>
<div class="outline-text-3" id="text-4-1">
<p>
High resolution (2560 pixel) photos of best half that I took (about 200 total):
</p>
<ul class="org-ul">
<li><a href="https://www.facebook.com/media/set/?set=a.674312419247193.1073741829.484394724905631&type=1&l=e7d75dd035">Pre-Party at Pivotal Labs, September 19, 2013</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.674315479246887.1073741830.484394724905631&type=1&l=5e5f0ccdf2">Sessions, September 20, 2013</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.674317992579969.1073741831.484394724905631&type=1&l=84732636b8">After-Party, September 20, 2013</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.674798672531901.1073741832.484394724905631&type=1&l=d50e526b26">Sessions, September 21, 2013</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.674800445865057.1073741833.484394724905631&type=1&l=ba7bd127b1">After-Party, September 21, 2013</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Flickr</h3>
<div class="outline-text-3" id="text-4-2">
<p>
I uploaded the full set of 2560 pixel images here. This has the half not shown
on Facebook.
</p>
<ul class="org-ul">
<li><a href="http://www.flickr.com/photos/justingordon/sets/72157635909414895/">First 200</a>: Pre-party, conference day 1, some of first after-party.
</li>
<li><a href="http://www.flickr.com/photos/justingordon/sets/72157635909144156/">Next 200</a>: Conference day 2.
</li>
<li><a href="http://www.flickr.com/photos/justingordon/sets/72157635909491013/">Last 134</a>: Conference day 2 and second post-party.
</li>
</ul>

<a target=_ href=https://www.facebook.com/photo.php?fbid=674800812531687&set=a.674800445865057.1073741833.484394724905631&type= >
<p>
{% img /images/2013-09-22-gogaruco-2013/GoGaRuCo2.jpg %}
</p>
</a>

<a target=_ href=https://www.facebook.com/photo.php?fbid=674319075913194&set=a.674317992579969.1073741831.484394724905631&type=1 >
<p>
{% img /images/2013-09-22-gogaruco-2013/GoGaRuCo3.jpg %}
</p>
</a>


<a target=_ href=https://www.facebook.com/photo.php?fbid=674799195865182&set=a.674798672531901.1073741832.484394724905631&type=1 >
<p>
{% img /images/2013-09-22-gogaruco-2013/GoGaRuCo4.jpg %}
</p>
</a>

<a target=_ href=https://www.facebook.com/photo.php?fbid=674321559246279&set=a.674317992579969.1073741831.484394724905631&type=1 >
<p>
{% img /images/2013-09-22-gogaruco-2013/GoGaRuCo5.jpg %}
</p>
</a>
</div>
</div>
</div>
